Repository: IcemanEA/TextFilter
Catalog: TextFilter/TextFilter/Supporting Files/*.lproj/Localizable.strings
Languages: ru

# StringsFilter.title
source: Text filter
ru: Фильтр строк

# StringsFilter.TextField.url
source: Enter URL
ru: Введите адрес

# StringsFilter.TextField.filter
source: Enter filter text
ru: Введите строку для фильтрации

# StringsFilter.Button.apply
source: Apply
ru: Применить

# StringsFilter.Button.cancel
source: Cancel
ru: Отменить

# StringsFilter.Warning.noUrL
source: Please, enter URL address
ru: Вы не указали адрес!

# Alert.Title.error
source: Error
ru: Ошибка

# Alert.Title.warning
source: Warning
ru: Внимание

# Alert.Button.ok
source: OK
ru: Ок

# FilesManagerError.fileAlreadyExists
source: File already exists
ru: Файл уже существует

# FilesManagerError.fileNotExist
source: File not found
ru: Файл не найден

# FilesManagerError.invalidDirectory
source: Invalid directory
ru: Неправильная директория

# FilesManagerError.writtingFailed
source: Writting failed:
ru: Ошибка записи:

# FilesManagerError.readingFailed
source: Reading failed:
ru: Ошибка чтения:

# NetworkError.invalidURL
source: Invalid URL
ru: Неверный URL адрес

# NetworkError.noData
source: Cant't load data from Network
ru: Неверно загрузились данные из сети

# NetworkError.noNetwork
source: Internet Error:
ru: Ошибка сети:

# FilterServiceError.invalidComponentString
source: Invalid components String
ru: Не могу разнести данные на строки

# FilterServiceError.invalidRegex
source: Invalid reular expression
ru: Ошибка в строке фильтра
